cmsis-svd/cmsis-svd/data/Microchip/ATSAME70Q.svd
            <register>
               <name>XDMAC_GIM</name>
               <description>Global Interrupt Mask Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IM0</name>
                     <description>XDMAC Channel 0 Interrupt Mask Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM1</name>
                     <description>XDMAC Channel 1 Interrupt Mask Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM2</name>
                     <description>XDMAC Channel 2 Interrupt Mask Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM3</name>
                     <description>XDMAC Channel 3 Interrupt Mask Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM4</name>
                     <description>XDMAC Channel 4 Interrupt Mask Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM5</name>
                     <description>XDMAC Channel 5 Interrupt Mask Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM6</name>
                     <description>XDMAC Channel 6 Interrupt Mask Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM7</name>
                     <description>XDMAC Channel 7 Interrupt Mask Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM8</name>
                     <description>XDMAC Channel 8 Interrupt Mask Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM9</name>
                     <description>XDMAC Channel 9 Interrupt Mask Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM10</name>
                     <description>XDMAC Channel 10 Interrupt Mask Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM11</name>
                     <description>XDMAC Channel 11 Interrupt Mask Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM12</name>
                     <description>XDMAC Channel 12 Interrupt Mask Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM13</name>
                     <description>XDMAC Channel 13 Interrupt Mask Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM14</name>
                     <description>XDMAC Channel 14 Interrupt Mask Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM15</name>
                     <description>XDMAC Channel 15 Interrupt Mask Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM16</name>
                     <description>XDMAC Channel 16 Interrupt Mask Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM17</name>
                     <description>XDMAC Channel 17 Interrupt Mask Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM18</name>
                     <description>XDMAC Channel 18 Interrupt Mask Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM19</name>
                     <description>XDMAC Channel 19 Interrupt Mask Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM20</name>
                     <description>XDMAC Channel 20 Interrupt Mask Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM21</name>
                     <description>XDMAC Channel 21 Interrupt Mask Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM22</name>
                     <description>XDMAC Channel 22 Interrupt Mask Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IM23</name>
                     <description>XDMAC Channel 23 Interrupt Mask Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XDMAC_GIS</name>
               <description>Global Interrupt Status Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IS0</name>
                     <description>XDMAC Channel 0 Interrupt Status Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS1</name>
                     <description>XDMAC Channel 1 Interrupt Status Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS2</name>
                     <description>XDMAC Channel 2 Interrupt Status Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS3</name>
                     <description>XDMAC Channel 3 Interrupt Status Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS4</name>
                     <description>XDMAC Channel 4 Interrupt Status Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS5</name>
                     <description>XDMAC Channel 5 Interrupt Status Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS6</name>
                     <description>XDMAC Channel 6 Interrupt Status Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS7</name>
                     <description>XDMAC Channel 7 Interrupt Status Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS8</name>
                     <description>XDMAC Channel 8 Interrupt Status Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS9</name>
                     <description>XDMAC Channel 9 Interrupt Status Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS10</name>
                     <description>XDMAC Channel 10 Interrupt Status Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS11</name>
                     <description>XDMAC Channel 11 Interrupt Status Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS12</name>
                     <description>XDMAC Channel 12 Interrupt Status Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS13</name>
                     <description>XDMAC Channel 13 Interrupt Status Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS14</name>
                     <description>XDMAC Channel 14 Interrupt Status Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS15</name>
                     <description>XDMAC Channel 15 Interrupt Status Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS16</name>
                     <description>XDMAC Channel 16 Interrupt Status Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS17</name>
                     <description>XDMAC Channel 17 Interrupt Status Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS18</name>
                     <description>XDMAC Channel 18 Interrupt Status Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS19</name>
                     <description>XDMAC Channel 19 Interrupt Status Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS20</name>
                     <description>XDMAC Channel 20 Interrupt Status Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS21</name>
                     <description>XDMAC Channel 21 Interrupt Status Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS22</name>
                     <description>XDMAC Channel 22 Interrupt Status Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IS23</name>
                     <description>XDMAC Channel 23 Interrupt Status Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XDMAC_GE</name>
               <description>Global Channel Enable Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>EN0</name>
                     <description>XDMAC Channel 0 Enable Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN1</name>
                     <description>XDMAC Channel 1 Enable Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN2</name>
                     <description>XDMAC Channel 2 Enable Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN3</name>
                     <description>XDMAC Channel 3 Enable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN4</name>
                     <description>XDMAC Channel 4 Enable Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN5</name>
                     <description>XDMAC Channel 5 Enable Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN6</name>
                     <description>XDMAC Channel 6 Enable Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN7</name>
                     <description>XDMAC Channel 7 Enable Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN8</name>
                     <description>XDMAC Channel 8 Enable Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN9</name>
                     <description>XDMAC Channel 9 Enable Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN10</name>
                     <description>XDMAC Channel 10 Enable Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN11</name>
                     <description>XDMAC Channel 11 Enable Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN12</name>
                     <description>XDMAC Channel 12 Enable Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN13</name>
                     <description>XDMAC Channel 13 Enable Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN14</name>
                     <description>XDMAC Channel 14 Enable Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN15</name>
                     <description>XDMAC Channel 15 Enable Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN16</name>
                     <description>XDMAC Channel 16 Enable Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN17</name>
                     <description>XDMAC Channel 17 Enable Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN18</name>
                     <description>XDMAC Channel 18 Enable Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN19</name>
                     <description>XDMAC Channel 19 Enable Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN20</name>
                     <description>XDMAC Channel 20 Enable Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN21</name>
                     <description>XDMAC Channel 21 Enable Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN22</name>
                     <description>XDMAC Channel 22 Enable Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN23</name>
                     <description>XDMAC Channel 23 Enable Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
